#+Title: Exercise 3.67
Modify the pairs procedure so that (pairs integers integers) will produce the stream of all pairs of integers (i,j) (without the condition i ≤ j). Hint: You will need to mix in an additional stream.

#+BEGIN_SRC scheme :session 3-67 :exports none
  (add-to-load-path (dirname "./"))

  (use-modules (custom-module stream))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC scheme :session 3-67 :exports both
  (define (pairs s t)
    (cons-stream
     (list (stream-car s) (stream-car t))
     (interleave
      (interleave
       (stream-map (lambda (x) (list (stream-car s) x))
                   (stream-cdr t))
       (stream-map (lambda (x) (list (stream-car t) x))
                   (stream-cdr s)))
      (pairs (stream-cdr s) (stream-cdr t)))))

  (map (lambda (x)
         (stream-ref (pairs
                      integers
                      (stream-map (lambda (x) (* x -1)) integers))
                     x))
       '(0 1 2 3 4 5 6 7 8))
#+END_SRC

#+RESULTS:
|  1 | -1 |
|  1 | -2 |
|  2 | -2 |
| -1 |  2 |
|  2 | -3 |
|  1 | -3 |
|  3 | -3 |
| -1 |  3 |
| -2 |  3 |
